<!DOCTYPE html>



  


<html class="theme-next muse use-motion" lang="zh-Hans">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>
<meta name="theme-color" content="#222">









<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />
















  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />







<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.1.4" rel="stylesheet" type="text/css" />


  <link rel="apple-touch-icon" sizes="180x180" href="/images/apple-touch-icon-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon-32x32-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon-16x16-next.png?v=5.1.4">


  <link rel="mask-icon" href="/images/logo.svg?v=5.1.4" color="#222">





  <meta name="keywords" content="内核安全,driver," />










<meta name="description" content="数据类型 基本数据类型1.1 不同的C语言编译器或者不同的目标平台编译，有可能造成一些数据类型(e.g.:unsigned long)表示的字节长度不同。1.2 WDK编程规范中对基本数据类型进行了重新定义。usigned long  -&amp;gt; ULONGusigned char  -&amp;gt; UCHARusigned int   -&amp;gt; UINTvoid          -&amp;gt; VO">
<meta name="keywords" content="内核安全,driver">
<meta property="og:type" content="article">
<meta property="og:title" content="Windows内核安全编程">
<meta property="og:url" content="http://yoursite.com/2018/06/29/Windows内核安全编程/index.html">
<meta property="og:site_name" content="Hexo">
<meta property="og:description" content="数据类型 基本数据类型1.1 不同的C语言编译器或者不同的目标平台编译，有可能造成一些数据类型(e.g.:unsigned long)表示的字节长度不同。1.2 WDK编程规范中对基本数据类型进行了重新定义。usigned long  -&amp;gt; ULONGusigned char  -&amp;gt; UCHARusigned int   -&amp;gt; UINTvoid          -&amp;gt; VO">
<meta property="og:locale" content="zh-Hans">
<meta property="og:image" content="http://pawmsj1et.bkt.clouddn.com/NTSTATUS.jpg">
<meta property="og:updated_time" content="2018-06-29T09:02:26.542Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Windows内核安全编程">
<meta name="twitter:description" content="数据类型 基本数据类型1.1 不同的C语言编译器或者不同的目标平台编译，有可能造成一些数据类型(e.g.:unsigned long)表示的字节长度不同。1.2 WDK编程规范中对基本数据类型进行了重新定义。usigned long  -&amp;gt; ULONGusigned char  -&amp;gt; UCHARusigned int   -&amp;gt; UINTvoid          -&amp;gt; VO">
<meta name="twitter:image" content="http://pawmsj1et.bkt.clouddn.com/NTSTATUS.jpg">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Muse',
    version: '5.1.4',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":false,"onmobile":false},
    fancybox: true,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>



  <link rel="canonical" href="http://yoursite.com/2018/06/29/Windows内核安全编程/"/>





  <title>Windows内核安全编程 | Hexo</title>
  








</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/"  class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">Hexo</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
      
        <p class="site-subtitle"></p>
      
  </div>

  <div class="site-nav-toggle">
    <button>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      

      
    </ul>
  

  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="http://yoursite.com/2018/06/29/Windows内核安全编程/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="Claus Lam">
      <meta itemprop="description" content="">
      <meta itemprop="image" content="/default_avatar.png">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="Hexo">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">Windows内核安全编程</h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2018-06-29T16:59:50+08:00">
                2018-06-29
              </time>
            

            

            
          </span>

          
            <span class="post-category" >
            
              <span class="post-meta-divider">|</span>
            
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              
                <span class="post-meta-item-text">分类于</span>
              
              
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/categories/笔记/" itemprop="url" rel="index">
                    <span itemprop="name">笔记</span>
                  </a>
                </span>

                
                
              
            </span>
          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        <h3 id="数据类型"><a href="#数据类型" class="headerlink" title="数据类型"></a>数据类型</h3><ol>
<li>基本数据类型<br>1.1 不同的C语言编译器或者不同的目标平台编译，有可能造成一些数据类型(e.g.:unsigned long)表示的字节长度不同。<br>1.2 WDK编程规范中对基本数据类型进行了重新定义。<br><code>usigned long  -&gt; ULONG</code><br><code>usigned char  -&gt; UCHAR</code><br><code>usigned int   -&gt; UINT</code><br><code>void          -&gt; VOID</code><br><code>usigned long* -&gt; PULONG</code><br><code>usigned char* -&gt; PUCHAR</code><br><code>usigned int*  -&gt; PUINT</code><br><code>void*         -&gt; PVOID</code></li>
<li>返回状态<br>绝大部分内核API的返回值都是一个返回状态，也就是一个错误码。即 NTSTATUS。常见的值如下表：</li>
</ol>
<p><img src="http://pawmsj1et.bkt.clouddn.com/NTSTATUS.jpg" alt=""><br>返回值还有很多，如果得到奇怪的NTSTATUS的值，可以在WDK的头文件中(e.g.: ntstatus.h)找寻答案。</p>
<h3 id="数据结构"><a href="#数据结构" class="headerlink" title="数据结构"></a>数据结构</h3><ol>
<li>驱动对象<br>Windows内核采用面向对象的编程方式，但是使用的却是C语言。所以”Windows内核对象”，并不是C++类对象，而是Windows的内核程序员使用C语言对面向对象编程方式的一种模拟。<br>一个驱动对象代表了一个驱动程序，或者说一个内核模块。驱动对象的结构如下：<pre><code>kd&gt; dt _DRIVER_OBJECT
ntdll!_DRIVER_OBJECT
   //类型
   +0x000 Type             : Int2B
   //大小
   +0x002 Size             : Int2B
   // 设备对象，这里实际上是一个设备对象的链表的开始。因为DeviceObject中有相关链表信息。
   +0x004 DeviceObject     : Ptr32 _DEVICE_OBJECT
   +0x008 Flags            : Uint4B
   //开始地址
   +0x00c DriverStart      : Ptr32 Void
   //大小
   +0x010 DriverSize       : Uint4B
   +0x014 DriverSection    : Ptr32 Void
   +0x018 DriverExtension  : Ptr32 _DRIVER_EXTENSION
   //驱动名字
   +0x01c DriverName       : _UNICODE_STRING
   +0x024 HardwareDatabase : Ptr32 _UNICODE_STRING
   //快速IO分发函数
   +0x028 FastIoDispatch   : Ptr32 _FAST_IO_DISPATCH
   +0x02c DriverInit       : Ptr32     long
   +0x030 DriverStartIo    : Ptr32     void
   //驱动卸载函数
   +0x034 DriverUnload     : Ptr32     void
   //普通分发函数
   +0x038 MajorFunction    : [28] Ptr32     long
</code></pre>实际上，如果写一个驱动程序或者内核模块，要在Windows中加载，则须填写一个这样的结构。来告诉Windows提供哪些功能。</li>
<li>设备对象<br>2.1. 设备对象是内核中的重要对象，其重要性不亚于WinGUI中的窗口(Window)。在内核世界里，大部分”消息”都以IRP的方式传递。而设备对象(DEVICE_OBJECT)是唯一可以接受IRP的实体。<pre><code>kd&gt; dt _DEVICE_OBJECT
ntdll!_DEVICE_OBJECT
   +0x000 Type             : Int2B
   +0x002 Size             : Uint2B
   //引用计数
   +0x004 ReferenceCount   : Int4B
   //设备所属的驱动对象
   +0x008 DriverObject     : Ptr32 _DRIVER_OBJECT
   //指向下一个设备对象
   +0x00c NextDevice       : Ptr32 _DEVICE_OBJECT
   +0x010 AttachedDevice   : Ptr32 _DEVICE_OBJECT
   +0x014 CurrentIrp       : Ptr32 _IRP
   +0x018 Timer            : Ptr32 _IO_TIMER
   +0x01c Flags            : Uint4B
   +0x020 Characteristics  : Uint4B
   +0x024 Vpb              : Ptr32 _VPB
   +0x028 DeviceExtension  : Ptr32 Void
   //设备类型
   +0x02c DeviceType       : Uint4B
   //IRP栈大小
   +0x030 StackSize        : Char
   +0x034 Queue            : &lt;unnamed-tag&gt;
   +0x05c AlignmentRequirement : Uint4B
   +0x060 DeviceQueue      : _KDEVICE_QUEUE
   +0x074 Dpc              : _KDPC
   +0x094 ActiveThreadCount : Uint4B
   +0x098 SecurityDescriptor : Ptr32 Void
   +0x09c DeviceLock       : _KEVENT
   +0x0ac SectorSize       : Uint2B
   +0x0ae Spare1           : Uint2B
   +0x0b0 DeviceObjectExtension : Ptr32 _DEVOBJ_EXTENSION
   +0x0b4 Reserved         : Ptr32 Void
</code></pre>从这个结构看，可以发现驱动对象与设备对象之前的联系。驱动对象生成多个设备对象。而Windows向设备对象发送IRP时，驱动对象的分发函数中的某一个会被调用。<br><code>NTSTATUS MyDispatch(PDEVICE_OBJECT pDevice, PIRP pIrp);</code></li>
<li>请求<br>此处为内核中的请求。<br>示例：如果要求网卡发送一个数据包，或者向网卡请求把已经存在缓冲区里接收到的包读出来，这就是一个请求：如果读取一个文件从0开始的512个字节，这也是一个请求；如果在磁盘的64MB位置写入长达512个字节的一组数据，这还是一个请求。<br>大部分请求以IRP的形式发送。IRP也是一个内核数据结构，这个结构非常复杂。如下：<pre><code>kd&gt; dt _IRP
ntdll!_IRP
   //类型和大小
   +0x000 Type             : Int2B
   +0x002 Size             : Uint2B
   //内存描述符表指针。实际上，这里用来描述一个缓冲区。可以想象一个内核请求一般都需要一个缓冲区。
   +0x004 MdlAddress       : Ptr32 _MDL
   +0x008 Flags            : Uint4B
   //这个联合体中也有一个SystemBuffer。这是比MdlAddress稍微简单的表示缓冲区的一种方式。
   //IRP用MdlAddress还是用SystemBuffer取决于这次请求的IO方式。总之二者都有可能。
   +0x00c AssociatedIrp    : &lt;unnamed-tag&gt;
      union{
          struct _IRP* MasterIrp;
          __volatile LONG IrpCount;
          PVOID SystemBuffer;
      }AssociatedIrp;
   +0x010 ThreadListEntry  : _LIST_ENTRY
   //IO状态。一般请求完成之后的返回情况存放在这里。
   +0x018 IoStatus         : _IO_STATUS_BLOCK
   +0x020 RequestorMode    : Char
   +0x021 PendingReturned  : UChar
   //IRP栈空间大小
   +0x022 StackCount       : Char
   //IRP当前栈空间
   +0x023 CurrentLocation  : Char
   +0x024 Cancel           : UChar
   +0x025 CancelIrql       : UChar
   +0x026 ApcEnvironment   : Char
   +0x027 AllocationFlags  : UChar
   +0x028 UserIosb         : Ptr32 _IO_STATUS_BLOCK
   +0x02c UserEvent        : Ptr32 _KEVENT
   +0x030 Overlay          : &lt;unnamed-tag&gt;
   //用来取消一个未决请求的函数
   +0x038 CancelRoutine    : Ptr32     void 
   //与MdlAddress和SystemBuffer一样都可以表示缓冲区，但是缓冲区的特性稍有不同。
   +0x03c UserBuffer       : Ptr32 Void
   +0x040 Tail             : &lt;unnamed-tag&gt;
     union {
         struct {
             union {
                 KDEVICE_QUEUE_ENTRY DeviceQueueEntry;
                 struct{
                     PVOID DriverContext[4];
                 };
             };
             //发送这个请求的线程
             PETHREAD Thread;
             LIST_ENTRY ListEntry;
         }Overlay;
     }Tail;
</code></pre>这里值得注意的时IRP栈空间，它在传递过程中用来保存中间参数。请求类型：<br><code>生成请求：IRP_MJ_CREATE</code><br><code>查询请求：IRP_MJ_QUERY_INFORMATION</code><br><code>设置请求：IRP_MJ_SET_INFORMATION</code><br><code>控制请求：IRP_MJ_DEVICE_CONTROL / IRP_MJ_INTERAL_DEVICE_CONTROL</code><br><code>关闭请求：IRP_MJ_CLOSE</code><br><code>请求指针：IRP的指针。IRP* / PIRP</code></li>
</ol>
<h3 id="函数调用与多线程安全"><a href="#函数调用与多线程安全" class="headerlink" title="函数调用与多线程安全"></a>函数调用与多线程安全</h3><ol>
<li>大部分内核API都有前缀，主要的函数以Io-/Ex-/Rtl-/Ke-/Zw-/Nt-/Ps-开头。此外，与NDIS网络驱动开发相关的函数都是以Ndis-开头的，与开发WDF驱动相关的函数都是以Wdf-开头的。</li>
<li>函数的多线程安全，一个函数在被调用过程中，还未返回时，又再次被其它线程调用的情况下，函数执行结果的可靠性。<br><code>如果结果是可靠的，则这个函数是多线程安全的；</code><br><code>如果记过不可靠，则这个函数是非多线程安全的，原因是多线程冲突。</code><br>函数的多线程冲突在内核编程中远比用户态要常见。要注意多线程安全，我们可以通过下面几条规则来进行简单的判断：<ul>
<li>规则1：可能运行多线程环境的函数，必须是多线程安全的。只运行于单线程环境的函数，不需要多线程安全性。</li>
<li>规则2：如果函数A的所有的调用源只运行于同一单线程环境，则函数A也是运行在单线程环境的。</li>
<li>规则3：如果函数A的其中一个调用源是可能运行在多线程环境的，或者多个调用源可能运行于不同的可并发的多个线程环境，而且调用路径上没有采取多线程序列化成单线程的强制措施，则函数A也是可能运行在多线程环境的。</li>
<li>规则4：如果在函数A所有的可能运行在多线程的调用路径上，都有多线程序列化成单线程的强制措施，则函数A是运行在单线程环境的。(多线程序列化成单线程的强制措,是指互斥体/自旋锁等同步手段)</li>
<li>规则5：只使用函数内部资源，完全不使用全局变量/静态变量或者其它全局资源的函数是多线程安全的。</li>
<li>规则6：如果对某个全局变量或者静态变量的所有访问都被强制同步，则即使使用了全局变量等，函数也是多线程安全的。</li>
<li>其它情况是非多线程安全的，多用自旋锁来作为同步手段使得变为多线程安全。</li>
</ul>
</li>
<li>代码的中断级<br>中断级主要有Passive级和Dispatch级两种，Dispatch级比Passive级高。<br>在实际编程时，许多具有比较复杂功能的内核API都要求必须在Passive级执行。<br>只有比较简单的函数能在Dispatch级执行。调用任何一个内核API之前，必须查看WDK文档，了解这个内核API的中断级要求。判断中断级大部分情况下可以简单根据如下规则处理：<ul>
<li>规则1：如果在调用路径上没有特殊的情况(导致中断变化)，则一个函数执行时的中断级和它的调用源的中断级相同。</li>
<li>规则2：如果在调用路径上有获取自旋锁，则中断级随之升高；如果调用路径上有释放自旋锁，则中断级随之下降。</li>
</ul>
</li>
</ol>

      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/内核安全/" rel="tag"># 内核安全</a>
          
            <a href="/tags/driver/" rel="tag"># driver</a>
          
        </div>
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2018/06/26/段描述符/" rel="next" title="段描述符">
                <i class="fa fa-chevron-left"></i> 段描述符
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          

  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap">
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview-wrap">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview-wrap sidebar-panel">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <img class="site-author-image" itemprop="image"
                src="/default_avatar.png"
                alt="Claus Lam" />
            
              <p class="site-author-name" itemprop="name">Claus Lam</p>
              <p class="site-description motion-element" itemprop="description"></p>
          </div>

          <nav class="site-state motion-element">

            
              <div class="site-state-item site-state-posts">
              
                <a href="/archives/">
              
                  <span class="site-state-item-count">4</span>
                  <span class="site-state-item-name">日志</span>
                </a>
              </div>
            

            
              
              
              <div class="site-state-item site-state-categories">
                <a href="/categories/index.html">
                  <span class="site-state-item-count">1</span>
                  <span class="site-state-item-name">分类</span>
                </a>
              </div>
            

            
              
              
              <div class="site-state-item site-state-tags">
                <a href="/tags/index.html">
                  <span class="site-state-item-count">4</span>
                  <span class="site-state-item-name">标签</span>
                </a>
              </div>
            

          </nav>

          

          

          
          

          
          

          

        </div>
      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-3"><a class="nav-link" href="#数据类型"><span class="nav-number">1.</span> <span class="nav-text">数据类型</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#数据结构"><span class="nav-number">2.</span> <span class="nav-text">数据结构</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#函数调用与多线程安全"><span class="nav-number">3.</span> <span class="nav-text">函数调用与多线程安全</span></a></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; <span itemprop="copyrightYear">2018</span>
  <span class="with-love">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">Claus Lam</span>

  
</div>


  <div class="powered-by">由 <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a> 强力驱动</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 &mdash; <a class="theme-link" target="_blank" href="https://github.com/iissnan/hexo-theme-next">NexT.Muse</a> v5.1.4</div>




        







        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
      </div>
    

    

  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  












  
  
    <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>
  

  
  
    <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>
  


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.1.4"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.1.4"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.1.4"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.1.4"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.1.4"></script>



  


  




	





  





  












  





  

  

  

  
  

  

  

  

</body>
</html>
